RoboMagus/ESP32-MQTT-Bluetooth-Monitor/src/BluetoothScanner.cpp
// No mem release allows BT and BLE to work side-by-side, but is there enough mem left for the rest...?
    //esp_bt_mem_release(ESP_BT_MODE_BTDM);
    // esp_bt_controller_mem_release(ESP_BT_MODE_BLE);  // --> This fixes MEM Alloc failures in esp_bluedroid_enable!!!
#if 1
    // Call bluetooth start from esp32 arduino framework 
    if(!btStarted() && !btStart()){
        log_e("btStart failed");
        return;
    }

    esp_bluedroid_status_t bt_state = esp_bluedroid_get_status();
    if(bt_state == ESP_BLUEDROID_STATUS_UNINITIALIZED){
        if ((ret = esp_bluedroid_init()) != ESP_OK) {
            ESP_LOGE(GAP_TAG, "%s initialize bluedroid failed: %s\n", __func__, esp_err_to_name(ret));
            return;
        }
    }

    if (bt_state != ESP_BLUEDROID_STATUS_ENABLED) {
        if ((ret = esp_bluedroid_enable()) != ESP_OK) {
            ESP_LOGE(GAP_TAG, "%s enable bluedroid failed: %s\n", __func__, esp_err_to_name(ret));
            return;
        }
    }
            
    gap_init();
    startupGap();

#endif

    // Setup static callback wrapper helper function for ble Scan Completed callback function:    
    Callback<BLE_SCAN_COMPLETE_CALLBACK_SIGNATURE>::func = std::bind(&BluetoothScanner::bleScanCompleted, this, std::placeholders::_1);

    BLEDevice::init("");
    pBLEScan = BLEDevice::getScan(); //create new scan
    pBLEScan->setAdvertisedDeviceCallbacks(this);
    pBLEScan->setActiveScan(false); //active scan uses more power, but get results faster
    pBLEScan->setInterval(200);
    pBLEScan->setWindow(160); // less or equal setInterval value
    // Scan for 100ms, then not for 25ms
    
    bleScan_shouldStart = true;
}

// -----------------------------------------------
void BluetoothScanner::setup()
{
    // BT init malloc failure: 

// config.c L537
// static void config_parse(nvs_handle_t fp, config_t *config)
// ...
//  int buf_size = get_config_size_from_flash(fp);
//  char *buf = NULL;
//  if(buf_size == 0) { //First use nvs
//      goto error;
//  }
//  buf = osi_calloc(buf_size);

}

// -----------------------------------------------
void BluetoothScanner::bleScanCompleted(BLEScanResults)
{
    mSerial.println(">> bleScanCompleted()");
    
    bleScan_shouldStart = true;
}

// -----------------------------------------------
void BluetoothScanner::loop()
{
    SCOPED_STACK_ENTRY;
    // Handle read remote name result outside of callback if made available:
    if(!readRemoteNameResultQueue.empty()) {
        HandleReadRemoteNameResult(readRemoteNameResultQueue.front());
        readRemoteNameResultQueue.pop();
    }

    if(!bleAdvertisedDeviceResultQueue.empty()) {
        // mSerial.printf("Found %d ble devices\n", bleAdvertisedDeviceResultQueue.size());
        for(uint8_t i = 0; i < min(maxBleProcessPerIteration, bleAdvertisedDeviceResultQueue.size()); i++){
            HandleBleAdvertisementResult(bleAdvertisedDeviceResultQueue.front());
            bleAdvertisedDeviceResultQueue.pop();
            vTaskDelay(1);
        }
    }

    unsigned long current_millis = millis();

    // If scan is still active but timed out...
    if(scanMode != ScanType::None) {
        if(current_millis - getLastScanTime(scanMode) > timeout) {
            led.set(OFF);
            mSerial.println("Scan timed out. Reseting scanning state!\n");
            scanIndex = -1;
            scanMode = ScanType::None;
        }
    }

    if(scanMode != ScanType::None && !scanInProgress && btDevices.size() != 0) {
        if(current_millis > last_scan_iter_millis + scan_iter_interval || scanIndex != 0) { // only block first device of the list!
            last_scan_iter_millis = current_millis;

            // ToDo: walk scanning state machine if scan active...

            // Loop over devices to be scanned:
            uint8_t devices_checked;
            for (devices_checked = 0; devices_checked <= btDevices.size(); devices_checked++) {
                scanIndex = (scanIndex+1)%btDevices.size();
                if(scanIndex == 0) {
                    // If we loop over the devices to scan, we start a new iteration!
                    iterationScansLeft--;
                }

                if(scanForNextDevice()) {
                    break;
                }
            }
            if (devices_checked >= btDevices.size()) { // All devices scanned. No more scanning
                mSerial.println("Stopping All searches...\n\n");
                scanIndex = -1;
                scanMode = ScanType::None;

                bleScan_shouldStart = true; 
            }
        }   
    }   

    // Check for periodic scan:
    if(periodic_scan_interval > 0) {
        if(current_millis > getLastScanTime(ScanType::Either) + periodic_scan_interval*1000) {
            startBluetoothScan(ScanType::Either);
        }
    }

    // Start new ble scan only if not performing regular scan
    if(bleScan_shouldStart && scanMode == ScanType::None){
        pBLEScan->stop();
        //pBLEScan->clearResults(); Taken care of when starting with continue!
        
        scanContinueCount = (scanContinueCount+1)%scanContinueWraparound;
        if(scanContinueCount == 0) {
            mSerial.println("Starting clean BLE scan");
        }
        if(!pBLEScan->start(scanTime, static_cast<scanComplete_cb_t>(Callback<BLE_SCAN_COMPLETE_CALLBACK_SIGNATURE>::callback), scanContinueCount)) {
            mSerial.println("Problem starting BLE scan!!");
        }
        else{
            bleScan_shouldStart = false;
        }
    }

    // Check for outdated ble RSSI measurements and send update if needed:
    const auto _millis = millis();
    const unsigned long iBeaconTimeout = 30000; // 30s
    for (auto &iBeacon : iBeaconDevices){
        if(iBeacon.last_update_millis + iBeaconTimeout < _millis && !iBeacon.isVirgin()) {
            iBeacon.reset();
            mSerial.printf("Lost beacon '%s'. Resetting.\n", iBeacon.name.c_str());
            
            int filteredRssi = iBeacon.getFilteredRSSI();
            if(abs(filteredRssi - iBeacon.lastSentRssi) > 3) {
                char rssi_str[25] = "\"rssi\":\"\"";
                // snprintf(rssi_str, 24, "\"rssi\":\"\"", filteredRssi);
                iBeacon.lastSentRssi = filteredRssi;
                std::string topic = m_mqtt_topic + "/" + m_scanner_identity + "/" + iBeacon.name.c_str();
                mqtt.send_message(topic.c_str(), 
                        createConfidenceMessage(iBeacon.uuid.toString().c_str(), iBeacon.confidence, iBeacon.name.c_str(), mTime.dateTime("D M d Y H:i:s ~G~M~TO (T)").c_str(), m_retain, rssi_str, "KNOWN_BEACON").c_str(), m_retain
                    );
            }
        }
    }
}

// -----------------------------------------------
void BluetoothScanner::stop() {
    btStop();
}

// -----------------------------------------------
uint8_t BluetoothScanner::getNumScans(ScanType scanType) {
    uint8_t numScans = 0;
    switch(scanType) {
        case ScanType::Either:
            numScans = max(num_arrival_scans, num_departure_scans);
        break;

        case ScanType::Arrival:
            numScans = num_arrival_scans;
        break;

        case ScanType::Departure:
            numScans = num_departure_scans;
        break;

        case ScanType::None:
        default:
            numScans = 0;
    }
    return numScans;
}

// -----------------------------------------------
unsigned long BluetoothScanner::getLastScanTime(ScanType scanType) {
    switch(scanType) {
        case ScanType::Arrival:
            return last_arrival_scan_time;
            break;
        case ScanType::Departure:
            return last_departure_scan_time;
            break;
        case ScanType::Either:
            return min(last_departure_scan_time, last_arrival_scan_time);
            break;
        default:
            return 0;
            break;
    }
    return 0;
}

// -----------------------------------------------
void BluetoothScanner::setLastScanTime(ScanType scanType, unsigned long time) {
    switch(scanType) {
        case ScanType::Arrival:
            last_arrival_scan_time = time;
            break;
        case ScanType::Departure:
            last_departure_scan_time = time;
            break;
        case ScanType::Either:
            last_departure_scan_time = time;
            last_arrival_scan_time = time;
            break;
        default:
            break;
    }
}

// -----------------------------------------------
void BluetoothScanner::setNumArrivalScans(uint8_t val) {
    num_arrival_scans = val;
}

// -----------------------------------------------
void BluetoothScanner::setNumDepartureScans(uint8_t val) {
    num_departure_scans = val;
}

// -----------------------------------------------
void BluetoothScanner::setSecondsBetweenScanIters(unsigned long val) {
    scan_iter_interval = val;
}

// -----------------------------------------------
void BluetoothScanner::setBeaconExpiration(uint32_t val) {
    beacon_expiration_seconds = val;

