RoboMagus/ESP32-MQTT-Bluetooth-Monitor/src/BluetoothScanner.cpp
}

// -----------------------------------------------
void BluetoothScanner::setMinTimeBetweenScans(uint32_t val) {
    min_seconds_between_scans = val;
}

// -----------------------------------------------
void BluetoothScanner::setPeriodicScanInterval(uint32_t val) {
    periodic_scan_interval = val;
}

// -----------------------------------------------
void BluetoothScanner::setMqttTopic(const std::string& topic){
    m_mqtt_topic = topic;
}

// -----------------------------------------------
void BluetoothScanner::setScannerIdentity(const char* identity){
    m_scanner_identity = identity;
}

// -----------------------------------------------
void BluetoothScanner::setRetainFlag(bool flag) {
    m_retain = flag;
}

// -----------------------------------------------
void BluetoothScanner::startBluetoothScan(ScanType scanType) 
{
    SCOPED_STACK_ENTRY;
    uint8_t numScans = getNumScans(scanType);
    unsigned long reference_scan_time = getLastScanTime(scanType);
    unsigned long _millis = millis();

    // Only scan if the last scan was long ago enough...  
    if( _millis > reference_scan_time + min_seconds_between_scans*1000 && scanMode == ScanType::None) {        
        mSerial.printf("Starting search for devices with scantype %d\n  Set numScans to %d\n", (int)(scanType), numScans);

        scanMode = scanType;

        // Stop ble scan when starting regular scan:
        // pBLEScan->stop();

        std::lock_guard<std::mutex> lock(btDevicesMutex);
        // Set counter for all devices:
        iterationScansLeft = numScans;
        for( auto& dev : btDevices ) {
            if(scanMode == ScanType::Arrival && dev.state == 1) { // Device already present so only scan for departure
                dev.scansLeft = 0;
            }
            else if (scanMode == ScanType::Departure && dev.state == 0) { // Device not present, only scan for arrival
                dev.scansLeft = 0;
            }
            else {
                // ScanMode Either will always scan regardless of state.
                dev.scansLeft = numScans;
            }
        }

        // Start scanning at the beginning:
        scanIndex = 0;
        scanForNextDevice();

        setLastScanTime(scanMode, _millis);
        last_scan_iter_millis = _millis;
    }
    else {
        mSerial.println("Skipping BT scan. Too soon dude...");
        mSerial.printf("milllis %lu < %lu, scanIdx: %d\n", _millis, reference_scan_time + min_seconds_between_scans*1000, scanIndex);
    }
}

// -----------------------------------------------
bool BluetoothScanner::scanForNextDevice() {
    if(btDevices.size()) {
        auto& dev = btDevices.at(scanIndex);
        if(dev.scansLeft > 0) {
            led.set(128);
            scanInProgress = 1;
            esp_bt_gap_read_remote_name(dev.mac);
            mSerial.printf("Searching device: %s\n", dev.name.c_str());
            return true;
        }
    }
    return false;
}

// -----------------------------------------------
void BluetoothScanner::addKnownDevice(const std::string& input) {
    std::string _in = input;
    _in.erase(_in.find_last_not_of(" \t\n\v") + 1);
    std::string identifier = _in.substr(0, _in.find(" "));
    std::string alias = _in.substr(_in.find(" "));

    size_t first = alias.find_first_not_of(" \t\n\v");
    size_t last = alias.find_last_not_of(" \t\n\v");
    if(first != std::string::npos) {
        alias = alias.substr(first, (last-first+1));
    }

    BLEUUID ble_uuid = BLEUUID::fromString(identifier);

    esp_bd_addr_t addr;
    if(str2bda(identifier.c_str(), addr)) {
        addKnownDevice(addr, alias.c_str());
    }
    else if (!ble_uuid.equals(BLEUUID())) {
        addKnownIBeacon(ble_uuid, alias.c_str());
    }
}

// -----------------------------------------------
void BluetoothScanner::addKnownIBeacon(const BLEUUID uuid, const char* alias) {
    // Remove entry if it already existed in order to overwrite with updated one:
    deleteKnownIBeacon(uuid);

    {
        // Add to the set of currently known iBeacons:
        std::lock_guard<std::mutex> lock(iBeaconDevicesMutex);

        iBeaconDevices.emplace_back(uuid, String(alias));
        mSerial.printf("Added iBeacon '%s'\n", alias);
    }
}

// -----------------------------------------------
void BluetoothScanner::deleteKnownIBeacon(const BLEUUID uuid) {
    std::lock_guard<std::mutex> lock(iBeaconDevicesMutex);
    for (auto it = iBeaconDevices.begin(); it != iBeaconDevices.end(); /* NOTHING */) {
        if ((*it).uuid.equals(uuid)) {
            it = iBeaconDevices.erase(it);
        }
        else{
            ++it;
        }
    } 
}

// -----------------------------------------------
void BluetoothScanner::addKnownDevice(const esp_bd_addr_t mac, const char* alias) {
    char bda_str[18];
    if (bda2str(mac, bda_str, 18)) {
        // Add to the set of currently known devices:
        std::lock_guard<std::mutex> lock(btDevicesMutex);
        // Remove entry if it already existed in order to overwrite with updated one:
        removeFromBtDevices(mac);
        btDevices.emplace_back(mac, String(alias));
    }
}

// -----------------------------------------------
void BluetoothScanner::deleteKnownDevice(const std::string& mac) {
    esp_bd_addr_t addr;
    if(str2bda(mac.c_str(), addr)) {
        deleteKnownDevice(addr);
    }
}

// -----------------------------------------------
void BluetoothScanner::removeFromBtDevices(const esp_bd_addr_t mac) {
    for (auto it = btDevices.begin(); it != btDevices.end(); /* NOTHING */) {
        if (memcmp((*it).mac, mac, sizeof(esp_bd_addr_t)) == 0) {
            it = btDevices.erase(it);
        }
        else{
            ++it;
        }
    }  
}

// -----------------------------------------------
void BluetoothScanner::deleteKnownDevice(const esp_bd_addr_t mac) {
    std::lock_guard<std::mutex> lock(btDevicesMutex);
    removeFromBtDevices(mac);
}


// -----------------------------------------------
void BluetoothScanner::clearKnownDevices() {
    std::lock_guard<std::mutex> lock(btDevicesMutex);
    btDevices.clear();
}


// -----------------------------------------------
const std::vector<BluetoothScanner::btDeviceId_t>& BluetoothScanner::getBtDeviceStates() {
    std::lock_guard<std::mutex> lock(btDevicesMutex);
    return btDevices;
}

// -----------------------------------------------
void BluetoothScanner::SetReadRemoteNameResult(const esp_bt_gap_cb_param_t::read_rmt_name_param& remoteNameParam) {
    readRemoteNameResultQueue.push(remoteNameParam);
}

// -----------------------------------------------
void BluetoothScanner::HandleReadRemoteNameResult(esp_bt_gap_cb_param_t::read_rmt_name_param& remoteNameParam) {
    SCOPED_STACK_ENTRY;
    char macbuf[19];
    led.set(OFF);
    // If more scans are to be done, this causes the main loop to pick it up again!
    scanInProgress = 0; 

    std::lock_guard<std::mutex> lock(btDevicesMutex);
    btDeviceId_t& dev = btDevices.at(scanIndex);

    mSerial.printf("ScanResult Callback for dev(%d): %s, scansLeft %d \n", scanIndex, dev.name.c_str(), dev.scansLeft);

    // Decrement scansLeft for each finished scan:
    if (dev.scansLeft > 0) {
        dev.scansLeft--;
        mSerial.printf("Decrement scansleft for dev(%d): %s to %d \n", scanIndex, dev.name.c_str(), dev.scansLeft);
    }

    // Device found:
    if (ESP_BT_STATUS_SUCCESS == remoteNameParam.stat) {
        dev.confidence = 100;
        dev.state = 1;

        if(scanMode == ScanType::Arrival) {
            mSerial.printf("Found device, stopping Arrival Scan for %s\n", dev.name.c_str());
            dev.scansLeft = 0; // Stop scanning, We've found him!
        }

